{
    "title": "Silencing the Scribes: Muhammad's Poet Problem",
    "sectionId": "ch7_s2",
    "content": [
        {
            "type": "paragraph",
            "text": "Beyond the caravan raids and open battles, Muhammad's consolidation of power in Medina involved a darker, more insidious form of violence: the targeted assassination of individuals whose words, not swords, challenged his authority or mocked his claims. If you couldn't be persuaded or defeated on the battlefield, perhaps you could simply be eliminated under the cover of night. The cases of poets and critics like Ka'b ibn al-Ashraf, Asma bint Marwan, and Abu Afak reveal a chilling willingness to silence dissent through murder, often allegedly instigated or sanctioned by the Prophet himself."
        },
        {
            "type": "heading",
            "level": 4,
            "text": "Ka'b ibn al-Ashraf"
        },
        {
            "type": "paragraph",
            "text": "Ka'b ibn al-Ashraf, a prominent Jewish poet with Arab lineage, made the fatal mistake of grieving the Quraysh defeat at Badr. According to Islamic sources, he traveled to Mecca and composed poems mourning the Meccan dead and criticizing Muhammad. This was intolerable. Multiple Hadith accounts in Bukhari and Muslim record Muhammad directly asking his companions: \"Who is willing to kill Ka'b bin Al-Ashraf who has hurt Allah and His Messenger?\" Muhammad bin Maslama volunteered, and significantly, Muhammad explicitly granted them permission to use deception to lure Ka'b into a trap. They approached Ka'b pretending friendship, took him for a walk late at night, and then ambushed and killed him. A political poet, silenced by assassination, sanctioned deception, and the Prophet's command."
        },
        {
            "type": "heading",
            "level": 4,
            "text": "Asma bint Marwan"
        },
        {
            "type": "paragraph",
            "text": "Asma bint Marwan, a female poet from Medina, belonged to a tribe that was slow to embrace Islam. After the killing of another critic (Abu Afak), she composed poems mocking the Medinans for taking orders from an outsider (Muhammad) and implicitly calling for his death. Again, the response, according to Ibn Ishaq's Sira, was deadly. Muhammad reportedly asked, \"Who will rid me of Marwan's daughter?\" A blind man from her husband's tribe, Umayr bin Adiy al-Khatmi, took up the call. He crept into her house at night while she slept surrounded by her five children, removed the nursing infant from her breast, and plunged his sword into her. When Umayr reported back to Muhammad, the Prophet allegedly remarked with chilling indifference, \"Two goats will not butt their heads about her,\" implying her death was utterly inconsequential."
        },
        {
            "type": "heading",
            "level": 4,
            "text": "Abu Afak"
        },
        {
            "type": "paragraph",
            "text": "Then there was Abu Afak, an elderly Jewish man (some sources claim he was 120 years old) who wrote poems expressing discontent with Muhammad's arrival and leadership in Medina, lamenting how Muhammad had divided the previously allied tribes. Like clockwork, Muhammad allegedly asked, \"Who will deal with this rascal for me?\" Salim bin Umayr volunteered, tracked Abu Afak down while he slept outside his home, and killed him."
        },
        {
            "type": "paragraph",
            "text": "Apologists try desperately to justify these killings, painting the victims as dangerous traitors, warmongers, or inciters who posed an existential threat. It's nonsense. These were poets, satirists, critics – their weapons were words. Their \"crimes\" were disrespecting the Prophet or challenging his political consolidation. Their elimination through stealthy, often treacherous assassinations, seemingly ordered or approved by Muhammad, demonstrates a ruthless intolerance for dissent and a willingness to employ terror tactics against ideological opponents, regardless of whether they posed any actual physical threat. This wasn't warfare; it was political murder disguised as divine justice."
        }
    ]
}
