{
    "title": "Women Last: Gender Apartheid from Kabul to Tehran",
    "sectionId": "ch14_s2",
    "content": [
        {
            "type": "paragraph",
            "text": "Nowhere is the incompatibility of traditional Islamic doctrine with modern human rights more brutally apparent than in the systematic oppression of women across vast swathes of the Muslim world. While the severity varies, the underlying pattern is depressingly consistent: legal systems based on Sharia, combined with deeply entrenched patriarchal interpretations, relegate women to a subordinate status, denying them basic equality and autonomy. This isn't \"culture\"; it's religiously sanctioned misogyny."
        },
        {
            "type": "heading",
            "level": 4,
            "text": "Afghanistan: The Apex of Oppression"
        },
        {
            "type": "paragraph",
            "text": "Afghanistan under the Taliban represents the horrifying apex – a system explicitly described by UN experts as \"gender apartheid.\" Girls and women are banned from secondary and university education, severely restricted from working, forced into suffocating hijab and face coverings, denied freedom of movement without a male guardian (mahram), and effectively erased from public life. Their voices are silenced, their potential crushed. This isn't a distortion of Islam; it's a chillingly literal application of some of the most regressive interpretations found within its tradition."
        },
        {
            "type": "heading",
            "level": 4,
            "text": "Iran: Systemic Restrictions"
        },
        {
            "type": "paragraph",
            "text": "Iran, though presenting a different facade, operates under a similar system of \"gender apartheid,\" as characterized by human rights groups. The Islamic Republic restricts women's rights in virtually every sphere – marriage, divorce, inheritance, child custody, employment, political participation, even dress code. The violent crackdown following the Mahsa Amini protests, sparked by her death after being detained for \"improper hijab,\" laid bare the regime's brutality. Women activists face arbitrary arrest, flogging, lengthy prison sentences, even death sentences, for simply demanding basic rights and defying compulsory veiling laws. Their bodies and freedoms are treated as tools of state control, justified by religious dogma."
        },
        {
            "type": "heading",
            "level": 4,
            "text": "Broader Inequalities"
        },
        {
            "type": "paragraph",
            "text": "Even in countries perceived as more moderate, Sharia-influenced laws perpetuate inequality. Recent amendments to Iraq's Personal Status Law were condemned by Human Rights Watch for allowing marriage at 15 with judicial permission, violating international standards and leaving girls vulnerable to abuse. Saudi Arabia, despite superficial reforms, retains elements of the male guardianship system, limiting women's autonomy."
        },
        {
            "type": "paragraph",
            "text": "Apologists will claim these are \"misinterpretations\" or isolated cases. This is demonstrably false. The legal inferiority of women's testimony (Quran 2:282), their unequal inheritance share (Quran 4:11), the male right to unilateral divorce (talaq), the concept of male authority (qiwamah), and verses arguably permitting wife-beating (Quran 4:34) are all rooted in Islam's foundational texts. While progressive interpretations exist, the traditional readings, often backed by powerful religious establishments allied with the state, continue to legitimize widespread discrimination and oppression."
        },
        {
            "type": "paragraph",
            "text": "The suffering of women in many Muslim-majority countries isn't an unfortunate byproduct of poverty or political instability; it is the direct, predictable outcome of implementing legal and social systems based on religious doctrines that consider women inherently unequal to men. It's the bitter harvest of fourteen centuries of codified misogyny presented as divine will."
        }
    ]
}
