{
    "title": "Women Under Sharia: Separate and Unequal",
    "sectionId": "ch9_s2",
    "content": [
        {
            "type": "paragraph",
            "text": "Apologists often tout the supposed rights and protections granted to women under Sharia. They'll speak of women's right to own property, consent to marriage, and receive a dowry (mahr). While these provisions may have represented improvements over some pre-Islamic Arab customs, they exist within an overarching framework that fundamentally enshrines female inferiority and systemic discrimination. Sharia law doesn't liberate women; it codifies their subordination to men."
        },
        {
            "type": "heading",
            "level": 4,
            "text": "Legal Testimony"
        },
        {
            "type": "paragraph",
            "text": "Let's start with legal testimony. The infamous verse Quran 2:282, dealing with financial contracts, explicitly states to call \"two witnesses out of your own men. And if there are not two men (available), then a man and two women... so that if one of them (two women) errs, the other can remind her.\" The implication is undeniable and has shaped Islamic jurisprudence for centuries: in crucial financial matters, a woman's testimony is worth only half that of a man. Apologetic gymnastics try to explain this away – claiming women had less business experience (a historically contingent argument, not a timeless divine truth), or that it's about \"complementary witnessing\" due to supposed female forgetfulness. These are just sexist rationalizations trying to justify what the text plainly establishes: legal inequality based on gender. While women's testimony might be accepted equally or solely in specific \"female\" domains like childbirth, the general rule in vital economic and often criminal matters sets a clear precedent of discrimination."
        },
        {
            "type": "quote_block",
            "text_ref": "Quran 2:282 (Concept Summary)",
            "source_id": "quran_2_282",
            "text": "(Verse regarding financial testimony, stating requirement for one man and two women if two men are unavailable, implying unequal weight.)"
        },
        {
            "type": "heading",
            "level": 4,
            "text": "Inheritance"
        },
        {
            "type": "paragraph",
            "text": "Inheritance laws follow a similar pattern. The most commonly cited rule, from Quran 4:11, dictates: \"Allah commands you regarding your children: for the male, what is equal to the share of two females.\" Again, explicit textual inequality. Apologists argue this is justified because men have the primary financial responsibility to provide for the family. Even if that were universally true across history and culture (it isn't), it still doesn't justify granting women an inherently smaller share of parental wealth based solely on their gender. It reflects a patriarchal assumption that women are financially dependent appendages to men, not independent economic actors with equal rights. While other inheritance scenarios exist in Islamic law where women might inherit equally or even more than some men, the foundational 2:1 ratio for children reveals the system's discriminatory core."
        },
        {
            "type": "quote_block",
            "text_ref": "Quran 4:11 (Concept Summary)",
            "source_id": "quran_4_11",
            "text": "(Verse stating inheritance share for a male child is equal to that of two female children.)"
        },
        {
            "type": "heading",
            "level": 4,
            "text": "Marriage and Divorce"
        },
        {
            "type": "paragraph",
            "text": "Marriage and divorce rights further cement this inequality. While a woman must consent to marriage, the common requirement for a male guardian (wali) to validate the marriage contract undermines her full autonomy. In divorce, the disparity is stark. Men possess the unilateral right of talaq – they can divorce their wives relatively easily, often just by declaration (though procedural rules exist). Women seeking divorce typically must pursue khul', a process that usually requires returning their dowry and, critically, often necessitates the husband's agreement or a lengthy, difficult petition to a religious court proving specific grounds like abuse or abandonment. This imbalance grants men significantly more power and control within the marriage."
        },
         {
            "type": "paragraph",
            "text": "Add to this Quranic verses seemingly permitting wife-beating (4:34 - \"strike them [lightly]\" as a final step for disobedience), concepts of male authority over women (qiwamah), differing dress code requirements, and restrictions on travel without a male guardian (mahram) in some interpretations, and the picture is clear. Sharia law, derived from the Quran and Hadith, establishes a system where women are legally, economically, and socially subordinate to men. It's not a system of rights in the modern sense; it's a framework for patriarchal control."
        }
    ]
}
