{
    "title": "Following the Footsteps? Muhammad as the Original Jihadist",
    "sectionId": "ch15_s2",
    "content": [
        {
            "type": "paragraph",
            "text": "Extremist groups don't just pull verses out of thin air; they weave them into a narrative centered around emulating the actions and triumphs of the Prophet Muhammad himself, particularly his career as a military commander and state-builder in Medina. The Sira, the traditional biography of Muhammad, becomes not just history, but a practical guide, a blueprint for modern jihad. They see themselves as literally following in his footsteps."
        },
        {
            "type": "heading",
            "level": 4,
            "text": "Historical Precedents Used by Extremists"
        },
        {
            "type": "paragraph",
            "text": "Consider the Battle of Khaybar in 628 CE, where Muhammad conquered a wealthy Jewish oasis. This event is frequently invoked in modern Islamist rhetoric, especially anti-Semitic propaganda. The infamous chant, \"Khaybar, Khaybar, ya Yahud! Jaish Muhammad saufa ya'ud!\" (\"Khaybar, Khaybar, O Jews! The army of Muhammad will return!\"), heard at extremist rallies across the globe, explicitly links modern conflict to Muhammad's historical victory over Jewish tribes. Khaybar serves as a symbol of righteous conquest and the promised future subjugation of Islam's perceived enemies."
        },
        {
            "type": "paragraph",
            "text": "Similarly, Muhammad's brutal treatment of the Banu Qurayza tribe after the Battle of the Trench – the execution of all adult males and the enslavement of women and children – provides a chilling precedent for groups like ISIS when dealing with perceived \"traitors\" or apostates within their own ranks or among conquered populations. If the Prophet did it, they argue, it must be permissible, even obligatory, under certain circumstances."
        },
        {
            "type": "paragraph",
            "text": "The assassinations of Muhammad's critics, like Ka'b ibn al-Ashraf or Asma bint Marwan, offer justification for modern attacks on perceived blasphemers, satirists, or \"enemies of Islam.\" Groups can point to these incidents, sanctioned or ordered by Muhammad according to traditional sources, to legitimize violence against those who insult the Prophet or Islam today. They argue they are simply defending the Prophet's honor, just as his companions did."
        },
        {
            "type": "heading",
            "level": 4,
            "text": "Hijrah as a Modern Concept"
        },
        {
            "type": "paragraph",
            "text": "Even the concept of Hijrah, Muhammad's migration from Mecca to Medina, has been repurposed. ISIS explicitly called upon Muslims worldwide to perform hijrah to their short-lived \"Caliphate\" in Syria and Iraq, framing it as a religious duty mirroring the Prophet's own journey from the land of disbelief (dar al-kufr) to the land of Islam (dar al-Islam). They used Quranic verses related to the original Hijrah to add theological weight to this modern call for migration and allegiance to their extremist state."
        },
        {
            "type": "paragraph",
            "text": "By selectively highlighting these aspects of Muhammad's Sira – the military victories, the elimination of rivals, the enforcement of religious boundaries through violence, the establishment of an Islamic state through conquest – extremists construct an image of Muhammad not primarily as a spiritual guide, but as the archetypal warrior-prophet, the original jihadist commander whose methods are to be emulated. Apologists may focus on Muhammad's supposed mercy or his earlier Meccan patience, but extremists find ample material in his Medinan career, as documented in Islam's own traditional sources, to justify their violence, intolerance, and ambition for global domination. They believe they are merely completing the mission he began."
        }
    ]
}
