{
    "title": "The Real Price Tag – From Deplatforming to Death Threats",
    "sectionId": "ch1_s2",
    "content": [
        {
            "type": "paragraph",
            "text": "Make no mistake, the effort to silence criticism isn't just about name-calling or getting someone fired, though that happens constantly. It escalates, often rapidly, into genuine threats and deadly violence. This isn't theoretical; it's a grim reality faced by anyone who dares to cross the invisible red lines drawn around Islam and its prophet."
        },
        {
            "type": "paragraph",
            "text": "Look at the roll call. Richard Dawkins, a renowned scientist, gets \"no-platformed\" by a California radio station for supposedly \"abusive speech\" against Islam – even though his critiques targeted Islamism. Robert Spencer faces howling protests and condemnations at Stanford simply for presenting his analysis of jihad. Ex-Muslim activists like Ridvan, the \"Apostate Prophet,\" get kicked off platforms like Twitter, their accounts suspended through what looks like coordinated, malicious flagging campaigns. Losing your platform, losing your livelihood – that's often just the beginning."
        },
        {
            "type": "paragraph",
            "text": "It gets darker. Ayaan Hirsi Ali, who escaped Somalia and became a Dutch MP, has lived under constant death threats for years simply for criticizing the religion she left behind. She collaborated on a film, \"Submission,\" critiquing violence against women in Islam; her collaborator, filmmaker Theo van Gogh, had his throat slit on an Amsterdam street in broad daylight by a radical Islamist who pinned a note threatening Hirsi Ali to his chest with a knife."
        },
        {
            "type": "paragraph",
            "text": "Think about Taslima Nasrin, the Bangladeshi author. She received a death fatwa back in 1993 for her novel \"Shame,\" which depicted Muslim discrimination against Hindus. She was forced into exile, chased from country to country. Years later, jihadist groups still had her name on a \"global hit list\" of bloggers to be \"liquidated.\""
        },
        {
            "type": "paragraph",
            "text": "Remember the French teenager, Mila? Called Islam a \"religion of hate\" online after facing homophobic abuse from a Muslim commenter. What followed? Death threats so severe she had to leave school and live under police protection. A child."
        },
        {
            "type": "paragraph",
            "text": "And then there are the ones who paid the ultimate price. The cartoonists at Charlie Hebdo in Paris, massacred in their office for daring to draw Muhammad. Samuel Paty, a French history teacher, beheaded outside his school for showing those same cartoons in a class about free speech. And Salman Rushdie, living under a death fatwa for decades for his novel \"The Satanic Verses,\" finally attacked and grievously wounded on stage in New York."
        },
        {
            "type": "paragraph",
            "text": "This is the real price tag. This is the violent reality behind the polite demands for \"religious sensitivity.\" It's terrorism, plain and simple – using fear and bloodshed to enforce a religious blasphemy law globally, demanding that we all, Muslim and non-Muslim alike, submit to their dictates about who and what can be criticized. It's why speaking truth about Islam isn't just an intellectual exercise; it's an act that requires genuine courage in the face of potentially lethal consequences."
        }
    ]
}
