{
    "title": "The \"Jewish Problem\": A Step-by-Step Elimination",
    "sectionId": "ch6_s4",
    "content": [
        {
            "type": "paragraph",
            "text": "While the Constitution of Medina initially included the Jewish tribes as part of the Ummah, guaranteeing their religious freedom and internal autonomy, this fragile coexistence didn't last long. As Muhammad consolidated his political and military power, the influential and independent Jewish tribes increasingly came to be seen not as partners, but as obstacles or potential threats. What followed wasn't a single act of betrayal, but a chillingly systematic, step-by-step process of marginalization, expulsion, and ultimately, elimination, directly contradicting the spirit and letter of Muhammad's own initial agreement."
        },
        {
            "type": "heading",
            "level": 4,
            "text": "Banu Qaynuqa (624 CE)"
        },
        {
            "type": "paragraph",
            "text": "The Banu Qaynuqa were the first to go. Predominantly craftsmen and goldsmiths allied with the Khazraj (and thus connected to Muhammad's rival, Abdullah ibn Ubayy), their fate was sealed shortly after Muhammad's surprising victory against the Meccans at the Battle of Badr in 624 CE. The pretext was a marketplace incident where a Muslim woman was allegedly humiliated by a Jewish goldsmith, leading to killings. Muhammad declared this a violation of the Constitution, besieged the Qaynuqa fortress for about two weeks, and upon their surrender, initially intended to execute the men. Only the forceful intervention of Abdullah ibn Ubayy, pleading for his allies, convinced Muhammad to commute the sentence to expulsion. They were forced to leave Medina, abandoning their homes and businesses, their weapons confiscated. The message was clear: despite the Constitution, dissent or conflict with Muslims, especially after a show of Muslim military strength, would not be tolerated."
        },
        {
            "type": "heading",
            "level": 4,
            "text": "Banu Nadir (625 CE)"
        },
        {
            "type": "paragraph",
            "text": "Next came the Banu Nadir, wealthy landowners allied with the Aws tribe. In 625 CE, after the Muslims suffered a setback at the Battle of Uhud, Muhammad accused the Nadir of plotting to assassinate him by dropping a stone on his head while he visited their settlement (a conveniently timed accusation). Declaring this another breach of covenant, he gave them ten days to leave Medina. When they initially refused, hoping for support from allies like Abdullah ibn Ubayy (which never materialized effectively), Muhammad besieged them. To break their resistance, he ordered the destruction of their precious palm groves - their primary source of wealth. Eventually, they too surrendered and were expelled, allowed to take only what their camels could carry, excluding armor and weapons. Their valuable lands were confiscated and distributed among Muhammad's close followers, particularly the Muhajirun, further enriching his base and consolidating his control over Medina's resources."
        },
        {
            "type": "heading",
            "level": 4,
            "text": "Banu Qurayza (627 CE)"
        },
        {
            "type": "paragraph",
            "text": "The final, brutal act came against the Banu Qurayza, the last major Jewish tribe, also allied with the Aws. Following the Battle of the Trench in 627 CE, where Medina was besieged by a large Meccan confederacy, the Qurayza were accused of treason – negotiating with the enemy during the siege. Whether these negotiations constituted a genuine breach of the pact or were exaggerated political maneuvering remains debated, but Muhammad seized the opportunity. After the Meccans withdrew, he immediately turned his forces on the Qurayza fortress, besieging them for nearly a month. Upon their surrender, they agreed to accept the judgment of their former ally, Sa'd ibn Mu'adh of the Aws. In a devastating display of how new religious loyalty trumped old tribal bonds, Sa'd, now a fervent Muslim, ruled that all the adult men (estimated between 600 and 800) should be executed, and the women and children enslaved. Muhammad reportedly approved this judgment, declaring it God's own verdict. Trenches were dug in the Medina marketplace, and the men were beheaded, their property seized, their families distributed among the Muslims."
        },
        {
            "type": "paragraph",
            "text": "This sequential elimination of the three major Jewish tribes within five years of the Constitution's establishment reveals a clear pattern. The initial promises of coexistence and autonomy were systematically dismantled. Each expulsion or massacre was justified by alleged treaty violations, but the pattern suggests a deliberate strategy to remove independent political and economic power centers within Medina, consolidating Muhammad's absolute control and fundamentally altering the city's multi-religious character into a firmly Islamic one. The Constitution wasn't betrayed by the Jews; it was rendered meaningless by the actions of the Prophet himself as his power grew."
        }
    ]
}
